---
kind: property
id: P:Autodesk.Revit.DB.Lighting.InitialIlluminanceIntensity.Distance
source: html/54aa7922-1490-5c08-c640-afd6050d1cd4.htm
---
# Autodesk.Revit.DB.Lighting.InitialIlluminanceIntensity.Distance Property

The illuminance intensity distance value.

## Syntax (C#)
```csharp
public double Distance { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The distance value is not valid because it is not between 0 and 1e+30.